In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df1 = pd.DataFrame([10,20,30,40,50])

In [5]:
df1

    0
0  10
1  20
2  30
3  40
4  50

In [6]:
type(df1)

pandas.core.frame.DataFrame

In [8]:
s1 = pd.Series([10,20,30,40,50])

In [9]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
type(s1)

pandas.core.series.Series

###  Creating with Variable

In [11]:
a = "INDIA"
b = "FRANCE"
c = "ENGLAND"
d = "JAPAN"
e = "CANADA"

In [13]:
dfcountry = pd.DataFrame([a, b, c, d, e])

In [14]:
dfcountry

         0
0    INDIA
1   FRANCE
2  ENGLAND
3    JAPAN
4   CANADA

In [15]:
dfcountry = pd.DataFrame([a, b, c, d, e], columns=["Country"])

In [16]:
dfcountry

   Country
0    INDIA
1   FRANCE
2  ENGLAND
3    JAPAN
4   CANADA

###  List and Nested List

In [17]:
clist = ["Blue","Orange","Red", "Yellow", "White"]

In [18]:
type(clist)

list

In [21]:
dfcolor = pd.DataFrame(clist, columns = ["Colours"])

In [22]:
dfcolor

  Colours
0    Blue
1  Orange
2     Red
3  Yellow
4   White

In [23]:
nlist = [ ["A","PM",100000], ["B", "TM", 75000], ["C", "Tester", 60000], ["D", "Developer", 80000]]

In [24]:
nlist

[['A', 'PM', 100000],
 ['B', 'TM', 75000],
 ['C', 'Tester', 60000],
 ['D', 'Developer', 80000]]

In [27]:
dfemp = pd.DataFrame(nlist, columns=["Name", "Designation", "Salary"])

In [28]:
dfemp

  Name Designation  Salary
0    A          PM  100000
1    B          TM   75000
2    C      Tester   60000
3    D   Developer   80000

In [29]:
dfemp["Name"]

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [30]:
dfemp["Designation"]

0           PM
1           TM
2       Tester
3    Developer
Name: Designation, dtype: object

In [31]:
dfemp["Salary"]

0    100000
1     75000
2     60000
3     80000
Name: Salary, dtype: int64

In [32]:
type( dfemp["Salary"])

pandas.core.series.Series

In [33]:
dfemp

  Name Designation  Salary
0    A          PM  100000
1    B          TM   75000
2    C      Tester   60000
3    D   Developer   80000

In [34]:
dfemp["Name"]

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [35]:
dfemp[["Name", "Designation"]]

  Name Designation
0    A          PM
1    B          TM
2    C      Tester
3    D   Developer

In [36]:
dfemp["Name", "Designation"]

KeyError: ('Name', 'Designation')

In [37]:
dfemp

  Name Designation  Salary
0    A          PM  100000
1    B          TM   75000
2    C      Tester   60000
3    D   Developer   80000

In [38]:
dfemp["Salary"]

0    100000
1     75000
2     60000
3     80000
Name: Salary, dtype: int64

In [39]:
dfemp[["Salary"]]

   Salary
0  100000
1   75000
2   60000
3   80000

In [40]:
type(dfemp[["Salary"]])

pandas.core.frame.DataFrame

### DataFrame with Scalar

In [43]:
dfsc = pd.DataFrame(9, index = [0,1,2,3], columns = ["A","B","C"])

In [44]:
dfsc

   A  B  C
0  9  9  9
1  9  9  9
2  9  9  9
3  9  9  9

### DataFrame from Numpy Array

In [47]:
ary1 = np.random.randint(100,200,(4,5))

In [48]:
ary1

array([[101, 117, 104, 194, 154],
       [148, 166, 111, 100, 132],
       [187, 149, 183, 145, 107],
       [121, 192, 151, 153, 151]])

In [50]:
dfnp = pd.DataFrame(ary1)

In [51]:
dfnp

     0    1    2    3    4
0  101  117  104  194  154
1  148  166  111  100  132
2  187  149  183  145  107
3  121  192  151  153  151

In [52]:
ary1

array([[101, 117, 104, 194, 154],
       [148, 166, 111, 100, 132],
       [187, 149, 183, 145, 107],
       [121, 192, 151, 153, 151]])

In [53]:
ary1[1][2]

111

In [54]:
dfnp

     0    1    2    3    4
0  101  117  104  194  154
1  148  166  111  100  132
2  187  149  183  145  107
3  121  192  151  153  151

In [55]:
dfnp[1][2]

149

In [57]:
dfnp[3][2]

145

###  Dataframe with Series

In [58]:
s1 = pd.Series(   np.arange(21,26) )

In [59]:
s1

0    21
1    22
2    23
3    24
4    25
dtype: int32

In [60]:
pd.DataFrame(s1)

    0
0  21
1  22
2  23
3  24
4  25

### DataFrame with Dictionary

In [61]:
dic1 = {
    
    "Name" : ["A","B","C","D"],
    "Desg" : ["PM","Dev","TM","Tester"],
    'Loc' : ['Delhi',"Hyd", "Che", "Vizag"],
    'Sal' : [100000,80000,90000, 60000]
    
}

In [62]:
dic1

{'Name': ['A', 'B', 'C', 'D'],
 'Desg': ['PM', 'Dev', 'TM', 'Tester'],
 'Loc': ['Delhi', 'Hyd', 'Che', 'Vizag'],
 'Sal': [100000, 80000, 90000, 60000]}

In [63]:
dfdic = pd.DataFrame(dic1)

In [64]:
dfdic

  Name    Desg    Loc     Sal
0    A      PM  Delhi  100000
1    B     Dev    Hyd   80000
2    C      TM    Che   90000
3    D  Tester  Vizag   60000

In [65]:
from sklearn.datasets import load_diabetes

In [66]:
dfdia = load_diabetes()

In [67]:
dfdia

{'data': array([[ 0.03807591,  0.05068012,  0.06169621, ..., -0.00259226,
          0.01990842, -0.01764613],
        [-0.00188202, -0.04464164, -0.05147406, ..., -0.03949338,
         -0.06832974, -0.09220405],
        [ 0.08529891,  0.05068012,  0.04445121, ..., -0.00259226,
          0.00286377, -0.02593034],
        ...,
        [ 0.04170844,  0.05068012, -0.01590626, ..., -0.01107952,
         -0.04687948,  0.01549073],
        [-0.04547248, -0.04464164,  0.03906215, ...,  0.02655962,
          0.04452837, -0.02593034],
        [-0.04547248, -0.04464164, -0.0730303 , ..., -0.03949338,
         -0.00421986,  0.00306441]]),
 'target': array([151.,  75., 141., 206., 135.,  97., 138.,  63., 110., 310., 101.,
         69., 179., 185., 118., 171., 166., 144.,  97., 168.,  68.,  49.,
         68., 245., 184., 202., 137.,  85., 131., 283., 129.,  59., 341.,
         87.,  65., 102., 265., 276., 252.,  90., 100.,  55.,  61.,  92.,
        259.,  53., 190., 142.,  75., 142., 155., 225.,  59., 104., 182.,
        128.,  52.,  37., 170., 170.,  61., 144.,  52., 128.,  71., 163.,
        150.,  97., 160., 178.,  48., 270., 202., 111.,  85.,  42., 170.,
        200., 252., 113., 143.,  51.,  52., 210.,  65., 141.,  55., 134.,
         42., 111.,  98., 164.,  48.,  96.,  90., 162., 150., 279.,  92.,
         83., 128., 102., 302., 198.,  95.,  53., 134., 144., 232.,  81.,
        104.,  59., 246., 297., 258., 229., 275., 281., 179., 200., 200.,
        173., 180.,  84., 121., 161.,  99., 109., 115., 268., 274., 158.,
        107.,  83., 103., 272.,  85., 280., 336., 281., 118., 317., 235.,
         60., 174., 259., 178., 128.,  96., 126., 288.,  88., 292.,  71.,
        197., 186.,  25.,  84.,  96., 195.,  53., 217., 172., 131., 214.,
         59.,  70., 220., 268., 152.,  47.,  74., 295., 101., 151., 127.,
        237., 225.,  81., 151., 107.,  64., 138., 185., 265., 101., 137.,
        143., 141.,  79., 292., 178.,  91., 116.,  86., 122.,  72., 129.,
        142.,  90., 158.,  39., 196., 222., 277.,  99., 196., 202., 155.,
         77., 191.,  70.,  73.,  49.,  65., 263., 248., 296., 214., 185.,
         78.,  93., 252., 150.,  77., 208.,  77., 108., 160.,  53., 220.,
        154., 259.,  90., 246., 124.,  67.,  72., 257., 262., 275., 177.,
         71.,  47., 187., 125.,  78.,  51., 258., 215., 303., 243.,  91.,
        150., 310., 153., 346.,  63.,  89.,  50.,  39., 103., 308., 116.,
        145.,  74.,  45., 115., 264.,  87., 202., 127., 182., 241.,  66.,
         94., 283.,  64., 102., 200., 265.,  94., 230., 181., 156., 233.,
         60., 219.,  80.,  68., 332., 248.,  84., 200.,  55.,  85.,  89.,
         31., 129.,  83., 275.,  65., 198., 236., 253., 124.,  44., 172.,
        114., 142., 109., 180., 144., 163., 147.,  97., 220., 190., 109.,
        191., 122., 230., 242., 248., 249., 192., 131., 237.,  78., 135.,
        244., 199., 270., 164.,  72.,  96., 306.,  91., 214.,  95., 216.,
        263., 178., 113., 200., 139., 139.,  88., 148.,  88., 243.,  71.,
         77., 109., 272.,  60.,  54., 221.,  90., 311., 281., 182., 321.,
         58., 262., 206., 233., 242., 123., 167.,  63., 197.,  71., 168.,
        140., 217., 121., 235., 245.,  40.,  52., 104., 132.,  88.,  69.,
        219.,  72., 201., 110.,  51., 277.,  63., 118.,  69., 273., 258.,
         43., 198., 242., 232., 175.,  93., 168., 275., 293., 281.,  72.,
        140., 189., 181., 209., 136., 261., 113., 131., 174., 257.,  55.,
         84.,  42., 146., 212., 233.,  91., 111., 152., 120.,  67., 310.,
         94., 183.,  66., 173.,  72.,  49.,  64.,  48., 178., 104., 132.,
        220.,  57.]),
 'frame': None,
 'DESCR': '.. _diabetes_dataset:\n\nDiabetes dataset\n----------------\n\nTen baseline variables, age, sex, body mass index, average blood\npressure, and six blood serum measurements were obtained for each of n =\n442 diabetes patients, as well as the response of interest, a\nquantitative measure of disease progression one year after baseline.\n\n**Data Set Characteristics:**\n\n  :Number of Instances: 442\n\n  :Number of Attributes: First 10 columns are numeric predictive values\n\n  :Target: Column 11 is a quantitative measure of disease progression one year after baseline\n\n  :Attribute Information:\n      - age     age in years\n      - sex\n      - bmi     body mass index\n      - bp      average blood pressure\n      - s1      tc, total serum cholesterol\n      - s2      ldl, low-density lipoproteins\n      - s3      hdl, high-density lipoproteins\n      - s4      tch, total cholesterol / HDL\n      - s5      ltg, possibly log of serum triglycerides level\n      - s6      glu, blood sugar level\n\nNote: Each of these 10 feature variables have been mean centered and scaled by the standard deviation times `n_samples` (i.e. the sum of squares of each column totals 1).\n\nSource URL:\nhttps://www4.stat.ncsu.edu/~boos/var.select/diabetes.html\n\nFor more information see:\nBradley Efron, Trevor Hastie, Iain Johnstone and Robert Tibshirani (2004) "Least Angle Regression," Annals of Statistics (with discussion), 407-499.\n(https://web.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf)',
 'feature_names': ['age',
  'sex',
  'bmi',
  'bp',
  's1',
  's2',
  's3',
  's4',
  's5',
  's6'],
 'data_filename': 'diabetes_data.csv.gz',
 'target_filename': 'diabetes_target.csv.gz',
 'data_module': 'sklearn.datasets.data'}

In [69]:
dfdia.keys()

dict_keys(['data', 'target', 'frame', 'DESCR', 'feature_names', 'data_filename', 'target_filename', 'data_module'])

In [70]:
dfdic

  Name    Desg    Loc     Sal
0    A      PM  Delhi  100000
1    B     Dev    Hyd   80000
2    C      TM    Che   90000
3    D  Tester  Vizag   60000

In [71]:
ary1

array([[101, 117, 104, 194, 154],
       [148, 166, 111, 100, 132],
       [187, 149, 183, 145, 107],
       [121, 192, 151, 153, 151]])

In [75]:
dfary = pd.DataFrame(ary1,index=["A","B","C","D"] , columns=["One","Two","Three","Four", "Five"])

In [76]:
dfary

   One  Two  Three  Four  Five
A  101  117    104   194   154
B  148  166    111   100   132
C  187  149    183   145   107
D  121  192    151   153   151

In [77]:
dfnp1 = pd.DataFrame(ary1)

In [78]:
dfnp1

     0    1    2    3    4
0  101  117  104  194  154
1  148  166  111  100  132
2  187  149  183  145  107
3  121  192  151  153  151

In [79]:
dfnp1.index

RangeIndex(start=0, stop=4, step=1)

In [80]:
dfnp1.index = ["A","B","C","D"]

In [81]:
dfnp1

     0    1    2    3    4
A  101  117  104  194  154
B  148  166  111  100  132
C  187  149  183  145  107
D  121  192  151  153  151

In [83]:
dfnp1.columns

RangeIndex(start=0, stop=5, step=1)

In [84]:
dfnp1.columns = ["One","Two","Three","Four","Five"]

In [85]:
dfnp1

   One  Two  Three  Four  Five
A  101  117    104   194   154
B  148  166    111   100   132
C  187  149    183   145   107
D  121  192    151   153   151

In [86]:
dfnp1["Three"]

A    104
B    111
C    183
D    151
Name: Three, dtype: int32

In [87]:
dfnp1["Three"].sum()

549

In [88]:
dfnp1["Three"].mean()

137.25

### Reading Data from CSV FILE

In [90]:
dfstd = pd.read_csv("C:/Users/hp/Desktop/Dataset_Pandas/std.csv")

In [91]:
dfstd

  Stdname Performance
0     AAA        Good
1     BBB   Excellent
2     CCC        Poor
3     DDD        Good
4     EEE        Poor
5     FFF   Excellent

In [92]:
dfstd["Performance"]

0         Good
1    Excellent
2         Poor
3         Good
4         Poor
5    Excellent
Name: Performance, dtype: object

In [93]:
dfstd[["Performance"]]

  Performance
0        Good
1   Excellent
2        Poor
3        Good
4        Poor
5   Excellent

In [94]:
dfmarks = pd.read_csv("C:/Users/hp/Desktop/Dataset_Pandas/std_data1.csv")

In [95]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE
0     A       10       67        66       66
1     B       12       87        56       65
2     C       11       66        89       63
3     D       10       56        88       66
4     E       10       89        90       56
5     F        9       88        85       89
6     G       12       90        83       88
7     H       11       79        88       90

In [96]:
dfmarks.shape

(8, 5)

In [97]:
dfmarks.ndim

2

In [98]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE
0     A       10       67        66       66
1     B       12       87        56       65
2     C       11       66        89       63
3     D       10       56        88       66
4     E       10       89        90       56
5     F        9       88        85       89
6     G       12       90        83       88
7     H       11       79        88       90

In [99]:
dfmarks["ENGLISH"]

0    67
1    87
2    66
3    56
4    89
5    88
6    90
7    79
Name: ENGLISH, dtype: int64

In [100]:
dfmarks["ENGLISH"] +  dfmarks["COMPUTER"]

0    133
1    143
2    155
3    144
4    179
5    173
6    173
7    167
dtype: int64

In [101]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE
0     A       10       67        66       66
1     B       12       87        56       65
2     C       11       66        89       63
3     D       10       56        88       66
4     E       10       89        90       56
5     F        9       88        85       89
6     G       12       90        83       88
7     H       11       79        88       90

In [102]:
dfmarks["ENGLISH"] +  dfmarks["COMPUTER"] + dfmarks["SCIENCE"]

0    199
1    208
2    218
3    210
4    235
5    262
6    261
7    257
dtype: int64

In [103]:
dfmarks["TOTAL"]

KeyError: 'TOTAL'

In [104]:
dfmarks["TOTAL"] =  dfmarks["ENGLISH"] +  dfmarks["COMPUTER"] + dfmarks["SCIENCE"]

In [105]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL
0     A       10       67        66       66    199
1     B       12       87        56       65    208
2     C       11       66        89       63    218
3     D       10       56        88       66    210
4     E       10       89        90       56    235
5     F        9       88        85       89    262
6     G       12       90        83       88    261
7     H       11       79        88       90    257

In [106]:
dfmarks["Average"] = dfmarks["TOTAL"] / 3

In [107]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL    Average
0     A       10       67        66       66    199  66.333333
1     B       12       87        56       65    208  69.333333
2     C       11       66        89       63    218  72.666667
3     D       10       56        88       66    210  70.000000
4     E       10       89        90       56    235  78.333333
5     F        9       88        85       89    262  87.333333
6     G       12       90        83       88    261  87.000000
7     H       11       79        88       90    257  85.666667

In [108]:
np.round(dfmarks["Average"])

0    66.0
1    69.0
2    73.0
3    70.0
4    78.0
5    87.0
6    87.0
7    86.0
Name: Average, dtype: float64

In [109]:
dfmarks["Average"] = np.round(dfmarks["Average"])

In [110]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average
0     A       10       67        66       66    199     66.0
1     B       12       87        56       65    208     69.0
2     C       11       66        89       63    218     73.0
3     D       10       56        88       66    210     70.0
4     E       10       89        90       56    235     78.0
5     F        9       88        85       89    262     87.0
6     G       12       90        83       88    261     87.0
7     H       11       79        88       90    257     86.0

In [111]:
dfmarks["Average"]

0    66.0
1    69.0
2    73.0
3    70.0
4    78.0
5    87.0
6    87.0
7    86.0
Name: Average, dtype: float64

In [112]:
dfmarks["Average"][0]

66.0

In [113]:
len(dfmarks["Average"])

8

In [115]:
import time

In [116]:
for i in range(len(dfmarks["Average"])):
    print(i)
    time.sleep(0.5)

0
1
2
3
4
5
6
7

In [117]:
for i in range(len(dfmarks["Average"])):
    print( dfmarks["Average"][i] )
    time.sleep(0.5)

66.0
69.0
73.0
70.0
78.0
87.0
87.0
86.0

In [119]:
reslist = []
for i in range(len(dfmarks["Average"])):
    avg =  dfmarks["Average"][i] 
    grd =  "A" if avg >= 80 else "B" if avg >= 60 else "C" if avg >= 40 else "D"
    print(grd)
    reslist.append(grd)
    time.sleep(0.5)

print(reslist)

B
B
B
B
B
A
A
A
['B', 'B', 'B', 'B', 'B', 'A', 'A', 'A']

In [120]:
dfmarks["Grade"] = reslist

In [121]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average Grade
0     A       10       67        66       66    199     66.0     B
1     B       12       87        56       65    208     69.0     B
2     C       11       66        89       63    218     73.0     B
3     D       10       56        88       66    210     70.0     B
4     E       10       89        90       56    235     78.0     B
5     F        9       88        85       89    262     87.0     A
6     G       12       90        83       88    261     87.0     A
7     H       11       79        88       90    257     86.0     A

###  Map and Lambda

In [122]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average Grade
0     A       10       67        66       66    199     66.0     B
1     B       12       87        56       65    208     69.0     B
2     C       11       66        89       63    218     73.0     B
3     D       10       56        88       66    210     70.0     B
4     E       10       89        90       56    235     78.0     B
5     F        9       88        85       89    262     87.0     A
6     G       12       90        83       88    261     87.0     A
7     H       11       79        88       90    257     86.0     A

In [125]:
dfmarks["Grade1"] = dfmarks["Average"].map(lambda x : "A" if x >= 80 else "B" if x >= 60 else "C" if x >= 40 else "D" )

In [126]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average Grade Grade1
0     A       10       67        66       66    199     66.0     B      B
1     B       12       87        56       65    208     69.0     B      B
2     C       11       66        89       63    218     73.0     B      B
3     D       10       56        88       66    210     70.0     B      B
4     E       10       89        90       56    235     78.0     B      B
5     F        9       88        85       89    262     87.0     A      A
6     G       12       90        83       88    261     87.0     A      A
7     H       11       79        88       90    257     86.0     A      A

In [127]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average Grade Grade1
0     A       10       67        66       66    199     66.0     B      B
1     B       12       87        56       65    208     69.0     B      B
2     C       11       66        89       63    218     73.0     B      B
3     D       10       56        88       66    210     70.0     B      B
4     E       10       89        90       56    235     78.0     B      B
5     F        9       88        85       89    262     87.0     A      A
6     G       12       90        83       88    261     87.0     A      A
7     H       11       79        88       90    257     86.0     A      A

In [128]:
dfmarks["Grade1"]

0    B
1    B
2    B
3    B
4    B
5    A
6    A
7    A
Name: Grade1, dtype: object

In [129]:
del dfmarks["Grade1"]

In [130]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average Grade
0     A       10       67        66       66    199     66.0     B
1     B       12       87        56       65    208     69.0     B
2     C       11       66        89       63    218     73.0     B
3     D       10       56        88       66    210     70.0     B
4     E       10       89        90       56    235     78.0     B
5     F        9       88        85       89    262     87.0     A
6     G       12       90        83       88    261     87.0     A
7     H       11       79        88       90    257     86.0     A

In [132]:
dfmarks.drop("Grade", axis = 1)

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average
0     A       10       67        66       66    199     66.0
1     B       12       87        56       65    208     69.0
2     C       11       66        89       63    218     73.0
3     D       10       56        88       66    210     70.0
4     E       10       89        90       56    235     78.0
5     F        9       88        85       89    262     87.0
6     G       12       90        83       88    261     87.0
7     H       11       79        88       90    257     86.0

In [133]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average Grade
0     A       10       67        66       66    199     66.0     B
1     B       12       87        56       65    208     69.0     B
2     C       11       66        89       63    218     73.0     B
3     D       10       56        88       66    210     70.0     B
4     E       10       89        90       56    235     78.0     B
5     F        9       88        85       89    262     87.0     A
6     G       12       90        83       88    261     87.0     A
7     H       11       79        88       90    257     86.0     A

In [135]:
dfmarks = dfmarks.drop("Grade", axis = 1)

In [136]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average
0     A       10       67        66       66    199     66.0
1     B       12       87        56       65    208     69.0
2     C       11       66        89       63    218     73.0
3     D       10       56        88       66    210     70.0
4     E       10       89        90       56    235     78.0
5     F        9       88        85       89    262     87.0
6     G       12       90        83       88    261     87.0
7     H       11       79        88       90    257     86.0

In [137]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average
0     A       10       67        66       66    199     66.0
1     B       12       87        56       65    208     69.0
2     C       11       66        89       63    218     73.0
3     D       10       56        88       66    210     70.0
4     E       10       89        90       56    235     78.0
5     F        9       88        85       89    262     87.0
6     G       12       90        83       88    261     87.0
7     H       11       79        88       90    257     86.0

In [139]:
dfmarks.drop("Average", axis = 1)

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL
0     A       10       67        66       66    199
1     B       12       87        56       65    208
2     C       11       66        89       63    218
3     D       10       56        88       66    210
4     E       10       89        90       56    235
5     F        9       88        85       89    262
6     G       12       90        83       88    261
7     H       11       79        88       90    257

In [140]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL  Average
0     A       10       67        66       66    199     66.0
1     B       12       87        56       65    208     69.0
2     C       11       66        89       63    218     73.0
3     D       10       56        88       66    210     70.0
4     E       10       89        90       56    235     78.0
5     F        9       88        85       89    262     87.0
6     G       12       90        83       88    261     87.0
7     H       11       79        88       90    257     86.0

In [141]:
dfmarks.drop("Average", axis = 1, inplace=True)

In [142]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL
0     A       10       67        66       66    199
1     B       12       87        56       65    208
2     C       11       66        89       63    218
3     D       10       56        88       66    210
4     E       10       89        90       56    235
5     F        9       88        85       89    262
6     G       12       90        83       88    261
7     H       11       79        88       90    257

In [143]:
dfmarks.drop(["SCIENCE","TOTAL"], axis = 1)

  SNAME  SCLASS   ENGLISH  COMPUTER
0     A       10       67        66
1     B       12       87        56
2     C       11       66        89
3     D       10       56        88
4     E       10       89        90
5     F        9       88        85
6     G       12       90        83
7     H       11       79        88

In [144]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER  SCIENCE  TOTAL
0     A       10       67        66       66    199
1     B       12       87        56       65    208
2     C       11       66        89       63    218
3     D       10       56        88       66    210
4     E       10       89        90       56    235
5     F        9       88        85       89    262
6     G       12       90        83       88    261
7     H       11       79        88       90    257

In [145]:
dfmarks.drop(["SCIENCE","TOTAL"], axis = 1, inplace=True)

In [146]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER
0     A       10       67        66
1     B       12       87        56
2     C       11       66        89
3     D       10       56        88
4     E       10       89        90
5     F        9       88        85
6     G       12       90        83
7     H       11       79        88

In [147]:
dfmarks[0]

KeyError: 0

###  ILOC   -- >  Locate based on Index (Numerical Value)
### LOC --->   Locate based on Index Label

In [148]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER
0     A       10       67        66
1     B       12       87        56
2     C       11       66        89
3     D       10       56        88
4     E       10       89        90
5     F        9       88        85
6     G       12       90        83
7     H       11       79        88

In [150]:
dfmarks.iloc[0]

SNAME        A
SCLASS      10
ENGLISH     67
COMPUTER    66
Name: 0, dtype: object

In [151]:
dfmarks.loc[0]

SNAME        A
SCLASS      10
ENGLISH     67
COMPUTER    66
Name: 0, dtype: object

In [152]:
dfmarks.iloc[4]

SNAME        E
SCLASS      10
ENGLISH     89
COMPUTER    90
Name: 4, dtype: object

In [153]:
dfmarks

  SNAME  SCLASS   ENGLISH  COMPUTER
0     A       10       67        66
1     B       12       87        56
2     C       11       66        89
3     D       10       56        88
4     E       10       89        90
5     F        9       88        85
6     G       12       90        83
7     H       11       79        88

In [154]:
dfmarks.index = ["Index1","Index2","Index3","Index4","Index5","Index6","Index7","Index8"]

In [155]:
dfmarks

       SNAME  SCLASS   ENGLISH  COMPUTER
Index1     A       10       67        66
Index2     B       12       87        56
Index3     C       11       66        89
Index4     D       10       56        88
Index5     E       10       89        90
Index6     F        9       88        85
Index7     G       12       90        83
Index8     H       11       79        88

In [157]:
dfmarks.iloc[6]

SNAME        G
SCLASS      12
ENGLISH     90
COMPUTER    83
Name: Index7, dtype: object

In [158]:
dfmarks.loc["Index7"]

SNAME        G
SCLASS      12
ENGLISH     90
COMPUTER    83
Name: Index7, dtype: object

In [159]:
dfmarks.loc["Index8"]

SNAME        H
SCLASS      11
ENGLISH     79
COMPUTER    88
Name: Index8, dtype: object

In [160]:
del dfmarks.loc["Index8"] # Error

AttributeError: __delitem__

In [161]:
dfmarks.drop("Index8")

       SNAME  SCLASS   ENGLISH  COMPUTER
Index1     A       10       67        66
Index2     B       12       87        56
Index3     C       11       66        89
Index4     D       10       56        88
Index5     E       10       89        90
Index6     F        9       88        85
Index7     G       12       90        83

In [162]:
dfmarks.drop("Index8", inplace=True)

In [163]:
dfmarks

       SNAME  SCLASS   ENGLISH  COMPUTER
Index1     A       10       67        66
Index2     B       12       87        56
Index3     C       11       66        89
Index4     D       10       56        88
Index5     E       10       89        90
Index6     F        9       88        85
Index7     G       12       90        83

In [164]:
dfmarks["SCLASS" : "COMPUTER"]

Empty DataFrame
Columns: [SNAME, SCLASS , ENGLISH, COMPUTER]
Index: []

In [165]:
dfmarks

       SNAME  SCLASS   ENGLISH  COMPUTER
Index1     A       10       67        66
Index2     B       12       87        56
Index3     C       11       66        89
Index4     D       10       56        88
Index5     E       10       89        90
Index6     F        9       88        85
Index7     G       12       90        83

In [166]:
dfmarks["Index2" : "Index6"]

       SNAME  SCLASS   ENGLISH  COMPUTER
Index2     B       12       87        56
Index3     C       11       66        89
Index4     D       10       56        88
Index5     E       10       89        90
Index6     F        9       88        85

In [168]:
dfmarks.loc["Index2" : "Index6" , "SCLASS" : "COMPUTER"]

        ENGLISH  COMPUTER
Index2       87        56
Index3       66        89
Index4       56        88
Index5       89        90
Index6       88        85

In [169]:
dfmarks.loc[ : , "ENGLISH" : "COMPUTER"]

        ENGLISH  COMPUTER
Index1       67        66
Index2       87        56
Index3       66        89
Index4       56        88
Index5       89        90
Index6       88        85
Index7       90        83

In [170]:
dfmarks

       SNAME  SCLASS   ENGLISH  COMPUTER
Index1     A       10       67        66
Index2     B       12       87        56
Index3     C       11       66        89
Index4     D       10       56        88
Index5     E       10       89        90
Index6     F        9       88        85
Index7     G       12       90        83

In [171]:
dfmarks.loc[ : ,  : "ENGLISH"]

       SNAME  SCLASS   ENGLISH
Index1     A       10       67
Index2     B       12       87
Index3     C       11       66
Index4     D       10       56
Index5     E       10       89
Index6     F        9       88
Index7     G       12       90